In [1]:
import pandas as pd

## 실습 1

In [3]:
score_list = [ 95, 80, 100, 85 ]
courses = ['국어', '수학', '영어', '국사']
score = pd.Series(score_list, index=courses, name='Kevin')
print(score)

국어     95
수학     80
영어    100
국사     85
Name: Kevin, dtype: int64

In [4]:
score_dict = { '국어': 95, '수학': 80, '영어': 100, '국사': 85 }
score_2 = pd.Series(score_dict, name='Kevin')
print(score_2)

국어     95
수학     80
영어    100
국사     85
Name: Kevin, dtype: int64

## 실습 4

In [6]:
score[['국어', '영어']]

국어     95
영어    100
Name: Kevin, dtype: int64

In [7]:
score['수학'] = 90
score

국어     95
수학     90
영어    100
국사     85
Name: Kevin, dtype: int64

In [8]:
score[score>=90]

국어     95
수학     90
영어    100
Name: Kevin, dtype: int64

In [9]:
result = (score >= 90)
type(result)
score[result]

국어     95
수학     90
영어    100
Name: Kevin, dtype: int64

## 실습 6

In [11]:
score_list = [ 50, 100, 70, 75 ]
courses = ['국어', '수학', '영어', '국사']
score_jane = pd.Series(score_list, index=courses, name='Jane')
print(score_jane)

국어     50
수학    100
영어     70
국사     75
Name: Jane, dtype: int64

In [12]:
score_df = pd.DataFrame({ 'Kevin': score, 'Jane': score_jane })
print(score_df)

    Kevin  Jane
국어     95    50
수학     90   100
영어    100    70
국사     85    75

In [13]:
score_df = pd.DataFrame({ score.name: score, score_jane.name: score_jane })
print(score_df)

    Kevin  Jane
국어     95    50
수학     90   100
영어    100    70
국사     85    75

In [14]:
score_list = [ 90, 95, 85, 100 ]
courses = ['국어', '영어', '국사', '과학']
score_jin = pd.Series(score_list, index=courses, name='Jin')
score_jin

국어     90
영어     95
국사     85
과학    100
Name: Jin, dtype: int64

In [15]:
score_df = pd.DataFrame({ 'Kevin': score, 'Jane': score_jane, 'Jin': score_jin })
score_df

    Kevin   Jane    Jin
과학    NaN    NaN  100.0
국사   85.0   75.0   85.0
국어   95.0   50.0   90.0
수학   90.0  100.0    NaN
영어  100.0   70.0   95.0

In [16]:
score_df.dtypes

Kevin    float64
Jane     float64
Jin      float64
dtype: object

## 실습 10

In [18]:
score_df['Jin']

과학    100.0
국사     85.0
국어     90.0
수학      NaN
영어     95.0
Name: Jin, dtype: float64

In [19]:
score_df[['Kevin', 'Jane']]

    Kevin   Jane
과학    NaN    NaN
국사   85.0   75.0
국어   95.0   50.0
수학   90.0  100.0
영어  100.0   70.0

In [20]:
score_df

    Kevin   Jane    Jin
과학    NaN    NaN  100.0
국사   85.0   75.0   85.0
국어   95.0   50.0   90.0
수학   90.0  100.0    NaN
영어  100.0   70.0   95.0

In [91]:
courses = ['국어', '수학', '영어', '국사']

score_kevin = [ 95, 80, 100, 85 ]
series_kevin = pd.Series(score_kevin, index=courses, name='Kevin')

score_jane = [ 50, 100, 70, 75 ]
series_jane = pd.Series(score_jane, index=courses, name='Jane')

courses_jin = ['국어', '영어', '국사', '과학']

score_jin = [ 90, 95, 85, 100 ]
series_jin = pd.Series(score_jin, index=courses_jin, name='Jin')

#score_df = pd.DataFrame({ 'Kevin': series_kevin, 'Jane': series_jane, 'Jin': series_jin })
score_df = pd.DataFrame({ 'Kevin': score_kevin, 'Jane': score_jane, 'Jin': series_jin })
score_df

    Kevin  Jane  Jin
국어     95    50   90
영어     80   100   95
국사    100    70   85
과학     85    75  100

## 실습 11

In [22]:
score_df.loc['국어']

Kevin    95.0
Jane     50.0
Jin      90.0
Name: 국어, dtype: float64

In [23]:
score_df.loc['수학', 'Jane']

100.0

In [24]:
score_df.loc[score_df['Jin'] >= 90]

    Kevin  Jane    Jin
과학    NaN   NaN  100.0
국어   95.0  50.0   90.0
영어  100.0  70.0   95.0

In [25]:
score_df.iloc[-2:]

    Kevin   Jane   Jin
수학   90.0  100.0   NaN
영어  100.0   70.0  95.0

## 실습 13

In [27]:
score_list = [ 60, 90, 95, 85, 100 ]
courses = ['과학', '국사', '국어', '수학', '영어']
score_bob = pd.Series(score_list, index=courses, name='Bob')
score_bob

과학     60
국사     90
국어     95
수학     85
영어    100
Name: Bob, dtype: int64

In [28]:
score_df['Bob'] = score_bob

In [29]:
score_df

    Kevin   Jane    Jin  Bob
과학    NaN    NaN  100.0   60
국사   85.0   75.0   85.0   90
국어   95.0   50.0   90.0   95
수학   90.0  100.0    NaN   85
영어  100.0   70.0   95.0  100

In [30]:
score_df.loc['과학', 'Kevin'] = 65
score_df

    Kevin   Jane    Jin  Bob
과학   65.0    NaN  100.0   60
국사   85.0   75.0   85.0   90
국어   95.0   50.0   90.0   95
수학   90.0  100.0    NaN   85
영어  100.0   70.0   95.0  100

In [31]:
score_df.rename(columns={'Kevin': '케빈', 'Jane': '제인', 'Jin': '진', 'Bob': '밥'}, inplace=True)
score_df

       케빈     제인      진    밥
과학   65.0    NaN  100.0   60
국사   85.0   75.0   85.0   90
국어   95.0   50.0   90.0   95
수학   90.0  100.0    NaN   85
영어  100.0   70.0   95.0  100

## 실습 14

In [32]:
score_df.isnull().sum(axis=1)

과학    1
국사    0
국어    0
수학    1
영어    0
dtype: int64

In [33]:
score_df.isnull().sum()

케빈    0
제인    1
진     1
밥     0
dtype: int64

In [34]:
score_df.dropna()

       케빈    제인     진    밥
국사   85.0  75.0  85.0   90
국어   95.0  50.0  90.0   95
영어  100.0  70.0  95.0  100

## 실습 15, 16

In [36]:
score_df.mean()

케빈    87.00
제인    73.75
진     92.50
밥     86.00
dtype: float64

In [37]:
score_df.mean(axis=1)

과학    75.000000
국사    83.750000
국어    82.500000
수학    91.666667
영어    91.250000
dtype: float64

In [38]:
score_df.agg(['max', 'min', 'mean'], axis=1)

      max   min       mean
과학  100.0  60.0  75.000000
국사   90.0  75.0  83.750000
국어   95.0  50.0  82.500000
수학  100.0  85.0  91.666667
영어  100.0  70.0  91.250000

In [39]:
score_df

       케빈     제인      진    밥
과학   65.0    NaN  100.0   60
국사   85.0   75.0   85.0   90
국어   95.0   50.0   90.0   95
수학   90.0  100.0    NaN   85
영어  100.0   70.0   95.0  100

In [40]:
score_df['분류'] = ['이과', '문과', '문과', '이과', '공통']
score_df

       케빈     제인      진    밥  분류
과학   65.0    NaN  100.0   60  이과
국사   85.0   75.0   85.0   90  문과
국어   95.0   50.0   90.0   95  문과
수학   90.0  100.0    NaN   85  이과
영어  100.0   70.0   95.0  100  공통

In [41]:
score_df.groupby('분류').mean()

       케빈     제인      진      밥
분류
공통  100.0   70.0   95.0  100.0
문과   90.0   62.5   87.5   92.5
이과   77.5  100.0  100.0   72.5

In [42]:
score_df.groupby('분류').agg(['max', 'min'])

       케빈            제인             진           밥
      max    min    max    min    max    min  max  min
분류
공통  100.0  100.0   70.0   70.0   95.0   95.0  100  100
문과   95.0   85.0   75.0   50.0   90.0   85.0   95   90
이과   90.0   65.0  100.0  100.0  100.0  100.0   85   60